#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ПроверяемыеРеквизиты.Добавить("ОтпускаСотрудников.Сотрудник");
	ПроверяемыеРеквизиты.Добавить("ОтпускаСотрудников.ДатаНачала");
	ПроверяемыеРеквизиты.Добавить("ОтпускаСотрудников.ДатаОкончания");
	
	ВыбранныйГод = НачалоГода(Год);
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		
		Если ВыбранныйГод <> НачалоГода(Строка.ДатаНачала) Тогда
			Сообщение = "Год ""Даты начала"" должен быть таким же как указано в реквизите документа ""Год""";
			ОбщегоНазначения.СообщитьПользователю(Сообщение, , "Объект.ОтпускаСотрудников[" + (Строка.НомерСтроки - 1) + "].ДатаНачала");
			Отказ = Истина;
		КонецЕсли;
		
		Если ВыбранныйГод <> НачалоГода(Строка.ДатаОкончания) Тогда
			Сообщение = "Год ""Даты окончания"" должен быть таким же как указано в реквизите документа ""Год""";
			ОбщегоНазначения.СообщитьПользователю(Сообщение, , "Объект.ОтпускаСотрудников[" + (Строка.НомерСтроки - 1) + "].ДатаОкончания");
			Отказ = Истина;
		КонецЕсли;
		
		Если  ((НачалоДня(Строка.ДатаОкончания) - НачалоДня(Строка.ДатаНачала)) / 86400 + 1) < 1 Тогда
			Сообщение = "Значение поля ""Дата окончания"" должно быть меньше либо равно значению поля ""Дата начала""";
			ОбщегоНазначения.СообщитьПользователю(Сообщение, , "Объект.ОтпускаСотрудников[" + (Строка.НомерСтроки - 1) + "].ДатаОкончания");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ВКМ_ГрафикиОтпусков.Записывать = Истина;
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ГрафикиОтпусков.Добавить();
		Движение.Период = Год;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.ДатаНачала = Строка.ДатаНачала;
		Движение.ДатаОкончания = Строка.ДатаОкончания; 
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли