
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьТабличнуюЧасть(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(СУММА(ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток), 0) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период,) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник";
	
	Запрос.УстановитьПараметр("Период", КонецМесяца(Объект.Дата));
		
	Выборка = Запрос.Выполнить().Выбрать();

	Объект.Выплаты.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Выплата = Объект.Выплаты.Добавить();
		ЗаполнитьЗначенияСвойств(Выплата, Выборка);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
