
#Область ОписаниеПеременных

&НаКлиенте
Перем АдресТЧВХранилище;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для Каждого Элемент Из Объект.ОтпускаСотрудников Цикл
		Если Элемент.ДатаОкончания > Элемент.ДатаНачала Тогда
			Элемент.КоличествоДней = (Элемент.ДатаОкончания - Элемент.ДатаНачала) / 86400;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти	

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	Объект.Год = НачалоГода(Объект.Год);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	ДанныеСтроки = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Если ДанныеСтроки.ДатаОкончания > ДанныеСтроки.ДатаНачала Тогда
		ДанныеСтроки.КоличествоДней = (ДанныеСтроки.ДатаОкончания - ДанныеСтроки.ДатаНачала) / 86400;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	ДанныеСтроки = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Если ДанныеСтроки.ДатаОкончания > ДанныеСтроки.ДатаНачала Тогда
		ДанныеСтроки.КоличествоДней = (ДанныеСтроки.ДатаОкончания - ДанныеСтроки.ДатаНачала) / 86400;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	АдресДанныхВХранилище = ПоместитьДанныеДокументаВХранилище();
	ПараметрыПодбора = Новый Структура("АдресДанныхДокумента", АдресДанныхВХранилище);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПараметрыПодбора, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьДанныеДокументаВХранилище()
	ДанныеДокумента = Новый Структура("Год", Объект.Год);
	ДанныеДокумента.Вставить("ОтпускаСотрудников", Объект.ОтпускаСотрудников.Выгрузить(,"Сотрудник, ДатаНачала, ДатаОкончания"));
	Возврат ПоместитьВоВременноеХранилище(ДанныеДокумента, УникальныйИдентификатор);
КонецФункции
#КонецОбласти