#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
		|	ДоговорыКонтрагентов.ВКМ_Дата КАК НачалоДействия,
		|	ДоговорыКонтрагентов.ВКМ_СрокДействия КАК ОкончаниеДействия,
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ПО (ДоговорыКонтрагентов.Ссылка = ВКМ_ОбслуживаниеКлиента.Договор)
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ВыборкаИзДоговора = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаИзДоговора.Следующий() Тогда
		Если ВыборкаИзДоговора.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_Абонент Тогда
			ОбщегоНазначения.СообщитьПользователю("Проведение невозможно. Указаный договор не является договором абонентского обслуживания.");
			Отказ = Истина;
		КонецЕсли;
		Если Не (Дата >= НачалоДня(ВыборкаИзДоговора.НачалоДействия) И Дата <= КонецДня(ВыборкаИзДоговора.ОкончаниеДействия)) Тогда
			ОбщегоНазначения.СообщитьПользователю("Проведение невозможно. Дата документа должна находиться между датой начала и датой окончания действия договора.");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту) КАК СуммаЧасовКОплате
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Дата, Клиент, Договор");
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Если Выборка.Следующий() Тогда
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = РеквизитыДокумента.Дата;
		Движение.Клиент = РеквизитыДокумента.Клиент;
		Движение.Договор = РеквизитыДокумента.Договор;
		Движение.КоличествоЧасов = Выборка.СуммаЧасовКОплате;
		Движение.СуммаКОплате = Выборка.СуммаЧасовКОплате * ВыборкаИзДоговора.СтоимостьЧасаРаботы;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли